package consts

const (
	ModelIntroduce = `当前支持模式包含：
	1）文心一言
	2）gpt3.5插件版
	默认模型为文心一言，仅支持单轮对话，多轮对话请选择gpt3.5插件版
	请选择你想切换的模型，切换口令为：模型选择+模型名称。如"模型选择 gpt3.5插件版"
`
	ModelHelpText = `操作指南：在群聊里可以艾特我聊天，私聊时无需艾特。会回复每一句话
	当前模型支持：
	1）文心一言
	2）gpt3.5插件版
	默认模型为文心一言，仅支持单轮对话，多轮对话请选择gpt3.5插件版。
	输入"模型选择"或"模型选择+模型名称"进行切换操作。
	如"模型选择 gpt3.5插件版"
`
)

/*
const (
	ModelIntroduce = `当前支持模式包含：
		1）UnifyChat模型A
		2）UnifyChat模型B
		默认模型为UnifyChat模型A，仅支持单轮对话，多轮对话请选择UnifyChat模型B
		请选择你想切换的模型，切换口令为：模型选择+模型名称。如"模型选择 UnifyChat模型B
	`
		ModelHelpText = `您好，我是您的专属UnifyAI，您可以向我提任何您感兴趣的问题，如“请把众人拾柴火焰高翻译成英文”、“辣椒炒肉怎么做”，我会回复您的每一句话~
		当前我的可选模型包含：
		1) UnifyChat模型A
		2) UnifyChat模型B
	其中，UnifyChat模型A拥有文心一言模型的功能，仅支持单轮对话；UnifyChat模型B拥有ChatGPT3.5模型的功能，可支持多轮对话；UnifyChat模型C、UnifyChat模型D正在超级加速开发中，后续模型的功能会更加强大，敬请期待！！！
	当前我的默认使用模型为UnifyChat模型A，如果您需要切换模型，请回复“模型选择UnifyChat模型A”或”模型选择UnifyChat模型B”进行模型切换操作。非默认使用模型存在重置默认设置，无操作时长达重置时长（10分钟）后将会自动切换回默认使用模型。
	请您务必规范合理操作，本AI设置有包括但不限于群聊检测、违规言论检测等检测机制，请勿进行任何违反微信账号常规使用的操作，一经检测出异常，系统将自动采取处理措施~
`
)
*/
